### Terraform Plan - Production 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary>Show Plan</summary>

```terraform tls_private_key.example_ssh: Refreshing state... [id=dd62dc9f4de327983067d0a89076bc2c536fdcda]
azurerm_resource_group.tdm_rg: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg]
azurerm_virtual_network.tdm_vnet: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/virtualNetworks/tdm_vnet]
azurerm_public_ip.tdm_public_ip: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/publicIPAddresses/tdm_public_ip]
azurerm_network_security_group.tdm_sec_group: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/networkSecurityGroups/tdm_security_group]
azurerm_subnet.tdm_subnet: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/virtualNetworks/tdm_vnet/subnets/tdm_subnet]
azurerm_network_interface.tdm_nic: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/networkInterfaces/tdm_nic]
azurerm_network_interface_security_group_association.tdm_sec_group_association: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/networkInterfaces/tdm_nic|/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Network/networkSecurityGroups/tdm_security_group]
azurerm_linux_virtual_machine.tdm_vm: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Compute/virtualMachines/tdm_vm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.tdm_vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "tdm_vm" {
      ~ custom_data                     = (sensitive value) # forces replacement
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/tdm_rg/providers/Microsoft.Compute/virtualMachines/tdm_vm" -> (known after apply)
        name                            = "tdm_vm"
      ~ private_ip_address              = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.1.4",
        ] -> (known after apply)
      ~ public_ip_address               = "20.231.73.128" -> (known after apply)
      ~ public_ip_addresses             = [
          - "20.231.73.128",
        ] -> (known after apply)
      - secure_boot_enabled             = false -> null
        tags                            = {
            "managed_by" = "terraform"
        }
      ~ virtual_machine_id              = "64c29ad2-5b11-42d8-b24b-a8f18e034f05" -> (known after apply)
      - vtpm_enabled                    = false -> null
      + zone                            = (known after apply)
        # (14 unchanged attributes hidden)


      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
            name                      = "tdm_os_disk"
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/`, Workflow: `pull_request`